morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
}

def solution(letter):
    letter_list = letter.split(" ")
    for i in range(len(letter_list)):
        letter_list[i] = morse[letter_list[i]]
    return ''.join(letter_list)

# 다른 풀이
# def solution(letter):
#     morse = {
#         '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
#         '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
#         '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
#         '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
#         '-.--':'y','--..':'z'
#     }

#     return ''.join([morse[i] for i in letter.split(' ')])     --> 문자열을 이용하여 바로 찾는 것도 가능하다.